from cucurbita.util import split_sentences


def test_ss_cabocha_default():
    sentence0 = "* 0 1D 0/1 2.206035\n隣\t名詞,一般,*,*,*,*,隣,トナリ,トナリ\nの\t助詞,連体化,*,*,*,*,の,ノ,ノ\n* 1 5D 0/1 -0.593304\n客\t名詞,一般,*,*,*,*,客,キャク,キャク\nは\t助詞,係助詞,*,*,*,*,は,ハ,ワ\n* 2 4D 0/0 0.538813\nよく\t副詞,一般,*,*,*,*,よく,ヨク,ヨク\n* 3 4D 0/0 1.985106\n柿\t名詞,一般,*,*,*,*,柿,カキ,カキ\n* 4 5D 0/0 -0.593304\n食う\t動詞,自立,*,*,五段・ワ行促音便,基本形,食う,クウ,クウ\n* 5 -1D 0/1 0.000000\n客\t名詞,一般,*,*,*,*,客,キャク,キャク\nだ\t助動詞,*,*,*,特殊・ダ,基本形,だ,ダ,ダ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"
    sentence1 = "* 0 3D 0/2 -1.113239\n庭\t名詞,一般,*,*,*,*,庭,ニワ,ニワ\nに\t助詞,格助詞,一般,*,*,*,に,ニ,ニ\nは\t助詞,係助詞,*,*,*,*,は,ハ,ワ\n* 1 3D 0/1 -1.113239\n鶏\t名詞,一般,*,*,*,*,鶏,ニワトリ,ニワトリ\nが\t助詞,格助詞,一般,*,*,*,が,ガ,ガ\n* 2 3D 1/1 -1.113239\n二\t名詞,数,*,*,*,*,二,ニ,ニ\n羽\t名詞,接尾,助数詞,*,*,*,羽,ワ,ワ\n* 3 -1D 0/2 0.000000\nい\t動詞,自立,*,*,一段,連用形,いる,イ,イ\nまし\t助動詞,*,*,*,特殊・マス,連用形,ます,マシ,マシ\nた\t助動詞,*,*,*,特殊・タ,基本形,た,タ,タ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"
    sentence2 = "* 0 2D 0/0 0.241567\nかえる\t動詞,自立,*,*,一段,基本形,かえる,カエル,カエル\n* 1 2D 0/0 0.493289\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n* 2 5D 1/1 -1.031915\n三\t名詞,数,*,*,*,*,三,サン,サン\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n、\t記号,読点,*,*,*,*,、,、,、\n* 3 5D 0/1 -1.031915\nあわせ\t動詞,自立,*,*,一段,連用形,あわせる,アワセ,アワセ\nて\t助詞,接続助詞,*,*,*,*,て,テ,テ\n* 4 5D 0/0 -1.031915\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n* 5 -1D 1/1 0.000000\n六\t名詞,数,*,*,*,*,六,ロク,ロク\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"

    document = sentence0 + sentence1 + sentence2
    sentences = [e for e in split_sentences(document)]

    assert len(sentences) == 3, "Invalid output length"
    assert sentence0 == sentences[0], "Invalid output data"
    assert sentence1 == sentences[1], "Invalid output data"
    assert sentence2 == sentences[2], "Invalid output data"


def test_ss_mecab_default():
    sentence0 = "隣\t名詞,一般,*,*,*,*,隣,トナリ,トナリ\nの\t助詞,連体化,*,*,*,*,の,ノ,ノ\n客\t名詞,一般,*,*,*,*,客,キャク,キャク\nは\t助詞,係助詞,*,*,*,*,は,ハ,ワ\nよく\t副詞,一般,*,*,*,*,よく,ヨク,ヨク\n柿\t名詞,一般,*,*,*,*,柿,カキ,カキ\n食う\t動詞,自立,*,*,五段・ワ行促音便,基本形,食う,クウ,クウ\n客\t名詞,一般,*,*,*,*,客,キャク,キャク\nだ\t助動詞,*,*,*,特殊・ダ,基本形,だ,ダ,ダ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"
    sentence1 = "庭\t名詞,一般,*,*,*,*,庭,ニワ,ニワ\nに\t助詞,格助詞,一般,*,*,*,に,ニ,ニ\nは\t助詞,係助詞,*,*,*,*,は,ハ,ワ\n鶏\t名詞,一般,*,*,*,*,鶏,ニワトリ,ニワトリ\nが\t助詞,格助詞,一般,*,*,*,が,ガ,ガ\n二\t名詞,数,*,*,*,*,二,ニ,ニ\n羽\t名詞,接尾,助数詞,*,*,*,羽,ワ,ワ\nい\t動詞,自立,*,*,一段,連用形,いる,イ,イ\nまし\t助動詞,*,*,*,特殊・マス,連用形,ます,マシ,マシ\nた\t助動詞,*,*,*,特殊・タ,基本形,た,タ,タ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"
    sentence2 = "かえる\t動詞,自立,*,*,一段,基本形,かえる,カエル,カエル\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n三\t名詞,数,*,*,*,*,三,サン,サン\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n、\t記号,読点,*,*,*,*,、,、,、\nあわせ\t動詞,自立,*,*,一段,連用形,あわせる,アワセ,アワセ\nて\t助詞,接続助詞,*,*,*,*,て,テ,テ\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n六\t名詞,数,*,*,*,*,六,ロク,ロク\nぴょこぴょこ\t副詞,一般,*,*,*,*,ぴょこぴょこ,ピョコピョコ,ピョコピョコ\n。\t記号,句点,*,*,*,*,。,。,。\nEOS\n"

    document = sentence0 + sentence1 + sentence2
    sentences = [e for e in split_sentences(document)]

    assert len(sentences) == 3, "Invalid output length"
    assert sentence0 == sentences[0], "Invalid output data"
    assert sentence1 == sentences[1], "Invalid output data"
    assert sentence2 == sentences[2], "Invalid output data"


def test_ss_blank():
    document = ""
    sentences = [e for e in split_sentences(document)]
    assert sentences == [], "Invalid output data"
